<?php

$x = "ABC";
$y = "AB";
if ($x >= $y)
	echo "$x >= $y";
else
	echo "$x < $y";
///////////////////////////////////  此上題答案 為 ABC >= AB , C大於
echo "<hr>";


$x = "ABC";
$y = "BA";
if ($x >= $y)
	echo "$x >= $y";
else
	echo "$x < $y";
///////////////////////////////////  此上題答案 為 ABC < BA , B已經大於了,所以之後都不用比 
echo "<hr>";


$x = "123";
$y = "12";
if ($x >= $y)
	echo "$x >= $y";
else
	echo "$x < $y";
///////////////////////////////////  此上題答案 為 123 >= 12 , PHP自動轉換為數字,因此123 > 12 
echo "<hr>";

$x = "123";
$y = "21";
if ($x >= $y)
	echo "$x >= $y";
else
	echo "$x < $y";
///////////////////////////////////  此上題答案 為 ABC >= AB , PHP自動轉換為數字,因此123 > 21
echo "<hr>";
		
		
?>